#include <iostream>
using namespace std;

 int main()
 {
   int a[4]; int chis[10]; int number; //первый массив - для хранения цифр числа, второй для вариантов перемножения чисел полученных из цифр искомого числа х

   for ( int x = 1000; x < 10000; x++) //перебор всех 4х значных чисел
    {
 
        number = x; 
        for ( int i = 1; i < 5; i++ )
        {
          a[i] = number % 10;
          number /= 10; //весь цикл for для разложения числа x по цифрам из введения этих цифр в массив a
        }
        number = x;

        chis[0]=(a[1]*10+a[2])*(a[3]*10+a[4]);  //с 20 по 31 строчку перебор вариантов перемножения двузначных чисел из цифр изначального числа, чтобы узнать какой из вариантов совпадет с x|number
        chis[1]=(a[2]*10+a[1])*(a[3]*10+a[4]);
        chis[2]=(a[1]*10+a[2])*(a[4]*10+a[3]);
        chis[3]=(a[2]*10+a[1])*(a[4]*10+a[3]);
        chis[4]=(a[1]*10+a[3])*(a[2]*10+a[4]);
        chis[5]=(a[3]*10+a[1])*(a[2]*10+a[4]);
        chis[6]=(a[1]*10+a[3])*(a[4]*10+a[2]);
        chis[7]=(a[3]*10+a[1])*(a[4]*10+a[2]);
        chis[7]=(a[1]*10+a[4])*(a[2]*10+a[3]);
        chis[8]=(a[4]*10+a[1])*(a[2]*10+a[3]);
        chis[9]=(a[1]*10+a[4])*(a[3]*10+a[2]);
        chis[10]=(a[4]*10+a[1])*(a[3]*10+a[2]);

        if ( chis [0] == number | chis [1] == number | chis [2] == number | chis [3] == number | chis [4] == number | chis [5] == number | chis [6] == number | chis [7] == number | chis [8] == number | chis [9] == number | chis [10] == number ) //сравнение полученных произведений с изначальным 4х значным числом
        {
          cout << number << endl; //вывод числа вампира
        }

    //  }
    }
   system ("pause");
   return (0);
 }
